Barfell/151RET6_MSC_CDC/STM32_SPI_SD/mmc_stm32l1_spi.c
/*------------------------------------------------------------------------*/
/* STM32F100: MMCv3/SDv1/SDv2 (SPI mode) control module                   */
/*------------------------------------------------------------------------*/
/*
/  Copyright (C) 2018, ChaN, all right reserved.
/
/ * This software is a free software and there is NO WARRANTY.
/ * No restriction on use. You can use, modify and redistribute it for
/   personal, non-profit or commercial products UNDER YOUR RESPONSIBILITY.
/ * Redistributions of source code must retain the above copyright notice.
/
/-------------------------------------------------------------------------*/

//#define SPI_CH	2	/* SPI channel to use = 1: SPI1, 11: SPI1/remap, 2: SPI2 */

//#define FCLK_SLOW() { SPIx_CR1 = (SPIx_CR1 & ~0x38) | 0x28; }	/* Set SCLK = PCLK / 64 */
//#define FCLK_FAST() { SPIx_CR1 = (SPIx_CR1 & ~0x38) | 0x00; }	/* Set SCLK = PCLK / 2 */

//#if SPI_CH == 1	/* PA4:MMC_CS, PA5:MMC_SCLK, PA6:MMC_DO, PA7:MMC_DI, PC4:MMC_CD */
//#define CS_HIGH()	GPIOA_BSRR = _BV(4)
//#define CS_LOW()	GPIOA_BSRR = _BV(4+16)
//#define	MMC_CD		0//!(GPIOC_IDR & _BV(4))	/* Card detect (yes:true, no:false, default:true) */
//#define	MMC_WP		0 /* Write protected (yes:true, no:false, default:false) */
//#define SPIx_CR1	SPI2_CR1
//#define SPIx_SR		SPI2_SR
//#define SPIx_DR		SPI2_DR
//#define	SPIxENABLE() {\
//	__enable_peripheral(SPI1EN);\
//	__enable_peripheral(IOPAEN);\
//	__enable_peripheral(IOPCEN);\
//	__gpio_conf_bit(GPIOA, 4, OUT_PP);						/* PA4: MMC_CS */\
//	__gpio_conf_bit(GPIOA, 5, ALT_PP);						/* PA5: MMC_SCLK */\
//	GPIOA_BSRR = _BV(6); __gpio_conf_bit(GPIOA, 6, IN_PUL); /* PA6: MMC_DO with pull-up */\
//	__gpio_conf_bit(GPIOA, 7, ALT_PP);						/* PA7: MMC_DI */\
//	GPIOC_BSRR = _BV(4); __gpio_conf_bit(GPIOC, 4, IN_PUL);	/* PC4: MMC_CD with pull-up */\
//	SPIx_CR1 = _BV(9)|_BV(8)|_BV(6)|_BV(2);					/* Enable SPI1 */\
//}

//#elif SPI_CH == 11	/* PA15:MMC_CS, PB3:MMC_SCLK, PB4:MMC_DO, PB5:MMC_DI, PB6:MMC_CD */
//#define CS_HIGH()	GPIOA_BSRR = _BV(15)
//#define CS_LOW()	GPIOA_BSRR = _BV(15+16)
//#define	MMC_CD		!(GPIOB_IDR & _BV(6))	/* Card detect (yes:true, no:false, default:true) */
//#define	MMC_WP		0 /* Write protected (yes:true, no:false, default:false) */
//#define SPIx_CR1	SPI1_CR1
//#define SPIx_SR		SPI1_SR
//#define SPIx_DR		SPI1_DR
//#define	SPIxENABLE() {\
//	AFIO_MAPR |= _BV(1);
//	__enable_peripheral(SPI1EN);\
//	__enable_peripheral(IOPAEN);\
//	__enable_peripheral(IOPBEN);\
//	__gpio_conf_bit(GPIOA, 15, OUT_PP); 						/* PA15: MMC_CS */\
//	__gpio_conf_bit(GPIOB, 3, ALT_PP);							/* PB3: MMC_SCLK */\
//	GPIOB_BSRR = _BV(4); __gpio_conf_bit(GPIOB, 4, IN_PUL);		/* PB4: MMC_DO with pull-up */\
//	__gpio_conf_bit(GPIOB, 5, ALT_PP);							/* PB5: MMC_DI */\
//	GPIOB_BSRR = _BV(6); __gpio_conf_bit(GPIOB, 6, IN_PUL);		/* PB6: MMC_CD with pull-up */\
//	SPIx_CR1 = _BV(9)|_BV(8)|_BV(6)|_BV(2);						/* Enable SPI1 */\
//}

//#elif SPI_CH == 2	/* PB12:MMC_CS, PB13:MMC_SCLK, PB14:MMC_DO, PB15:MMC_DI, PD8:MMC_CD */
//#define CS_HIGH()	GPIOB_BSRR = _BV(12)
//#define CS_LOW()	GPIOB_BSRR = _BV(12+16)
//#define	MMC_CD		!(GPIOD_IDR & _BV(8))	/* Card detect (yes:true, no:false, default:true) */
//#define	MMC_WP		0 /* Write protected (yes:true, no:false, default:false) */
//#define SPIx_CR1	SPI2_CR1
//#define SPIx_SR		SPI2_SR
//#define SPIx_DR		SPI2_DR
//#define	SPIxENABLE() {\
//	__enable_peripheral(SPI2EN);\
//	__enable_peripheral(IOPBEN);\
//	__enable_peripheral(IOPDEN);\
//	__gpio_conf_bit(GPIOB, 12, OUT_PP);							/* PB12: MMC_CS */\
//	__gpio_conf_bit(GPIOB, 13, ALT_PP);							/* PB13: MMC_SCLK */\
//	GPIOB_BSRR = _BV(14); __gpio_conf_bit(GPIOB, 14, IN_PUL); 	/* PB14: MMC_DO with pull-up */\
//	__gpio_conf_bit(GPIOB, 15, ALT_PP);							/* PB15: MMC_DI */\
//	GPIOD_BSRR = _BV(8); __gpio_conf_bit(GPIOD, 8, IN_PUL); 	/* PD8: MMC_CD with pull-up */\
//	SPIx_CR1 = _BV(9)|_BV(8)|_BV(6)|_BV(2);						/* Enable SPI1 */\
//}

//#endif

#include "main.h"
#include "spi.h"

extern SPI_HandleTypeDef hspi3;
#define SDTIMEOUT	1000

#define CS_HIGH()	HAL_GPIO_WritePin(SD1_CS_GPIO_Port, SD1_CS_Pin, GPIO_PIN_SET)
#define CS_LOW()	HAL_GPIO_WritePin(SD1_CS_GPIO_Port, SD1_CS_Pin, GPIO_PIN_RESET)

#define	MMC_CD		1
#define	MMC_WP		0

/* MMC card type flags (MMC_GET_TYPE) */
#define CT_MMC3		0x01		/* MMC ver 3 */
#define CT_MMC4		0x02		/* MMC ver 4+ */
#define CT_MMC		0x03		/* MMC */
#define CT_SDC1		0x02		/* SDC ver 1 */
#define CT_SDC2		0x04		/* SDC ver 2+ */
#define CT_SDC		0x0C		/* SDC */
#define CT_BLOCK	0x10		/* Block addressing */

/*--------------------------------------------------------------------------

   Module Private Functions

---------------------------------------------------------------------------*/

//#include "STM32F100.h"
#include "stm32l1xx_hal.h"
#include "diskio.h"


/* MMC/SD command */
#define CMD0	(0)			/* GO_IDLE_STATE */
#define CMD1	(1)			/* SEND_OP_COND (MMC) */
#define	ACMD41	(0x80+41)	/* SEND_OP_COND (SDC) */
#define CMD8	(8)			/* SEND_IF_COND */
#define CMD9	(9)			/* SEND_CSD */
#define CMD10	(10)		/* SEND_CID */
#define CMD12	(12)		/* STOP_TRANSMISSION */
#define ACMD13	(0x80+13)	/* SD_STATUS (SDC) */
#define CMD16	(16)		/* SET_BLOCKLEN */
#define CMD17	(17)		/* READ_SINGLE_BLOCK */
#define CMD18	(18)		/* READ_MULTIPLE_BLOCK */
#define CMD23	(23)		/* SET_BLOCK_COUNT (MMC) */
#define	ACMD23	(0x80+23)	/* SET_WR_BLK_ERASE_COUNT (SDC) */
#define CMD24	(24)		/* WRITE_BLOCK */
#define CMD25	(25)		/* WRITE_MULTIPLE_BLOCK */
#define CMD32	(32)		/* ERASE_ER_BLK_START */
#define CMD33	(33)		/* ERASE_ER_BLK_END */
#define CMD38	(38)		/* ERASE */
#define CMD55	(55)		/* APP_CMD */
#define CMD58	(58)		/* READ_OCR */


static volatile DSTATUS Stat = STA_NOINIT;	/* Physical drive status */
static volatile UINT Timer1, Timer2;		/* 1kHz decrement timer stopped at zero (disk_timerproc()) */

static BYTE CardType;	/* Card type flags */

static
void FCLK_SLOW()
{
//	__disable_irq();
	HAL_SPI_DeInit(&hspi3);
  hspi3.Instance = SPI3;
  hspi3.Init.Mode = SPI_MODE_MASTER;
  hspi3.Init.Direction = SPI_DIRECTION_2LINES;
  hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi3.Init.CLKPolarity = SPI_POLARITY_HIGH;
  hspi3.Init.CLKPhase = SPI_PHASE_2EDGE;
//  hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
//  hspi3.Init.CLKPhase = SPI_PHASE_1EDGE;	
  hspi3.Init.NSS = SPI_NSS_SOFT;
  hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256;
  hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi3.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi3) != HAL_OK)
  {
    Error_Handler();
  }
//	__enable_irq();
//	 MX_SPI3_Init();
}

static
void FCLK_FAST()
{
//#define FCLK_SLOW() { SPIx_CR1 = (SPIx_CR1 & ~0x38) | 0x28; }	/* Set SCLK = PCLK / 64 */
//#define FCLK_FAST() { SPIx_CR1 = (SPIx_CR1 & ~0x38) | 0x00; }	/* Set SCLK = PCLK / 2 */
	SPI3->CR1 = (SPI3->CR1 & ~0x38) | 0x00;
/*
Bits 5:3BR[2:0]:Baud rate control
000: fPCLK/2
001: fPCLK/4
010: fPCLK/8
011: fPCLK/16
100: fPCLK/32
101: fPCLK/64
110: fPCLK/128
111: fPCLK/256
*/	
/*//	__disable_irq();
	HAL_SPI_DeInit(&hspi3);
  hspi3.Instance = SPI3;
  hspi3.Init.Mode = SPI_MODE_MASTER;
  hspi3.Init.Direction = SPI_DIRECTION_2LINES;
  hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi3.Init.CLKPolarity = SPI_POLARITY_HIGH;
  hspi3.Init.CLKPhase = SPI_PHASE_2EDGE;
//  hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
//  hspi3.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi3.Init.NSS = SPI_NSS_SOFT;
  hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_4;
  hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi3.Init.CRCPolynomial = 10;
  if (HAL_SPI_Init(&hspi3) != HAL_OK)
  {
    Error_Handler();
  }
//	__enable_irq();*/
}

/*-----------------------------------------------------------------------*/
/* SPI controls (Platform dependent)                                     */
/*-----------------------------------------------------------------------*/

/* Initialize MMC interface */
static void init_spi (void)
{
	//SPIxENABLE();		/* Enable SPI function */
	FCLK_SLOW();
	CS_HIGH();			/* Set CS# high */

